## Challenge: How can you resample time series data (e.g., daily to monthly)?

## Importing pandas library

In [1]:
import pandas as pd

## Reading my file

In [13]:
df = pd.read_csv('tn_tomato_price.csv')
df.head()

         date      admin1             admin2           market  price  usdprice
0  2012-04-15  Tamil Nadu            Chennai          Chennai  18.78      0.36
1  2012-04-15  Tamil Nadu           Dindigul         Dindigul  21.61      0.42
2  2012-04-15  Tamil Nadu  Tiruchchirappalli  Thiruchirapalli  21.17      0.41
3  2012-07-15  Tamil Nadu            Chennai          Chennai  25.77      0.47
4  2012-07-15  Tamil Nadu           Dindigul         Dindigul  24.18      0.44

## slicing the dataframe and getting only date and price column

In [16]:
df_price = df[['date','price']].set_index('date')

In [22]:
df_price

            price
date
2012-04-15  18.78
2012-04-15  21.61
2012-04-15  21.17
2012-07-15  25.77
2012-07-15  24.18
...           ...
2021-07-15  19.71
2021-07-15  23.92
2021-07-15  19.74
2021-07-15  20.30
2021-07-15  17.74

[362 rows x 1 columns]

## Converting index to datetime index for doing time series

In [24]:
df_price.reset_index(inplace = True)

In [25]:
df_price

           date  price
0    2012-04-15  18.78
1    2012-04-15  21.61
2    2012-04-15  21.17
3    2012-07-15  25.77
4    2012-07-15  24.18
..          ...    ...
357  2021-07-15  19.71
358  2021-07-15  23.92
359  2021-07-15  19.74
360  2021-07-15  20.30
361  2021-07-15  17.74

[362 rows x 2 columns]

In [26]:
df_price['date'] = pd.to_datetime(df_price['date'])

In [30]:
df_price.set_index('date',inplace = True)

## Here we are aggregating the yearly date and finding the mean

In [36]:
yearly_data = df_price.resample('Y').mean()

In [37]:
yearly_data

                price
date
2012-12-31  16.200476
2013-12-31  22.113333
2014-12-31  15.852000
2015-12-31  20.673056
2016-12-31  19.870556
2017-12-31  27.824167
2018-12-31  13.417273
2019-12-31  25.310476
2020-12-31  22.502593
2021-12-31  17.514516

## This the average tomato price in tamilnadu for each year starting from 2012.